# GetPlainText Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..GetPlainText Method
FormattedText Class See Also
---
Returns the entire text in a plain text form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string GetPlainText()
```

Visual Basic
---
```text
Public Function GetPlainText As String
```

Visual C++
---
```text
public:
String^ GetPlainText()
```

# ### Return Value
The entire text in a plain text form.
# Remarks
The text includes a carriage return character ('\r') that is always present. As a result this method will never return an empty string.
# See Also
FormattedText Class
GetPlainText Overload
Autodesk.Revit.DB Namespace